step-by-step/030-populate-database/020-soap/1100-типы-устройств/0300.xml

<?xml version="1.0" ?>
<!-- Модули -> Интернет -> Устройства и ресурсы -> Типы устройств -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:deviceTypeUpdate xmlns:common="http://common.bitel.ru"
                              xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                              xmlns:xs="http://www.w3.org/2001/XMLSchema"
                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <arg0 xmlns="" activeConfigId="0" configId="0" deviceEntitySpecId="0" entityId="0" entitySpecId="0" id="2"
                  saHandlerClass="com.github.alexanderfefelov.bgbilling.device.murmuring.MurmuringServiceActivator"
                  protocolHandlerClass="com.github.alexanderfefelov.bgbilling.device.murmuring.MurmuringProtocolHandler"
                  deviceManagerClass="com.github.alexanderfefelov.bgbilling.device.mikrotik.RouterOsDeviceManager"
                  scriptId="0" title="MikroTik CRS-125" uniqueInterfaces="false" xsi:type="ns5:inetDeviceType">
                <comment></comment>
                <config></config>
                <managmentType>0</managmentType>
                <serviceActivationType>0</serviceActivationType>
                <source>true</source>
                <interfaceList>
                    <interfaceList deviceTypeId="0" id="1" title="ether1"></interfaceList>
                    <interfaceList deviceTypeId="0" id="2" title="ether2"></interfaceList>
                    <interfaceList deviceTypeId="0" id="3" title="ether3"></interfaceList>
                    <interfaceList deviceTypeId="0" id="4" title="ether4"></interfaceList>
                    <interfaceList deviceTypeId="0" id="5" title="ether5"></interfaceList>
                    <interfaceList deviceTypeId="0" id="6" title="ether6"></interfaceList>
                    <interfaceList deviceTypeId="0" id="7" title="ether7"></interfaceList>
                    <interfaceList deviceTypeId="0" id="8" title="ether8"></interfaceList>
                    <interfaceList deviceTypeId="0" id="9" title="ether9"></interfaceList>
                    <interfaceList deviceTypeId="0" id="10" title="ether10"></interfaceList>
                    <interfaceList deviceTypeId="0" id="11" title="ether11"></interfaceList>
                    <interfaceList deviceTypeId="0" id="12" title="ether12"></interfaceList>
                    <interfaceList deviceTypeId="0" id="13" title="ether13"></interfaceList>
                    <interfaceList deviceTypeId="0" id="14" title="ether14"></interfaceList>
                    <interfaceList deviceTypeId="0" id="15" title="ether15"></interfaceList>
                    <interfaceList deviceTypeId="0" id="16" title="ether16"></interfaceList>
                    <interfaceList deviceTypeId="0" id="17" title="ether17"></interfaceList>
                    <interfaceList deviceTypeId="0" id="18" title="ether18"></interfaceList>
                    <interfaceList deviceTypeId="0" id="19" title="ether19"></interfaceList>
                    <interfaceList deviceTypeId="0" id="20" title="ether20"></interfaceList>
                    <interfaceList deviceTypeId="0" id="21" title="ether21"></interfaceList>
                    <interfaceList deviceTypeId="0" id="22" title="ether22"></interfaceList>
                    <interfaceList deviceTypeId="0" id="23" title="ether23"></interfaceList>
                    <interfaceList deviceTypeId="0" id="24" title="ether24"></interfaceList>
                    <interfaceList deviceTypeId="0" id="25" title="sfp1"></interfaceList>
                </interfaceList>
            </arg0>
        </ns5:deviceTypeUpdate>
    </S:Body>
</S:Envelope>
